boaschti/ESP8266-Server/ESP_Server/ESPServer.cpp

//This Code generates a Webserver on ES8266 which provides
//- every value is changeable via browser
//- Ota setup via browser file upload with Password
//- MQTT connection
//- setup pages incl placeholder for a userconfigpage (handleconfigureUserWrite() and handleconfigureUser())
//- mdns setup
//- you can use pGC->tx_topic, pGC->rx_topic in you main code
//- you can create a UserSubscribe() funktion to make your own subscribe code
//- you can create a MQTTBrokerChanged() funktion



//- you only have to include this File and call setup_server()
//- you have to make a funktion to get messages: void callback(char* topic, byte* payload, unsigned int length) {}


//- you can add your UserPageName by search and replace
//- WifiManager.h move private: int           connectWifi(String ssid, String pass);  to public: int           connectWifi(String ssid, String pass);



#define SERIAL_BAUD   115200

#include "ESPServer.h"

#include <ESP8266WiFi.h>
#include <pgmspace.h>
#include <PubSubClient.h>

#ifndef DeviceName
  #define DeviceName "DeviceName"
#endif


// Default values
const char PROGMEM MDNS_NAME[] = DeviceName;
const char PROGMEM MQTTCLIENTNAME[] = DeviceName;
const char PROGMEM MQTT_BROKER[] = "none"; // none = mqtt off
const char PROGMEM RX_TOPIC[] = DeviceName"/set/#";
const char PROGMEM TX_TOPIC[] = DeviceName"/state";
const char PROGMEM AP_NAME[] = DeviceName"-AP";

//Passwort und Benutzer zum Softwareupdate ueber Browser
const char PROGMEM UPDATEUSER[]		  = "B";
const char PROGMEM UPDATEPASSWORD[] =	"B";
const char PROGMEM MQTTPASSWORD[]   = "B";
const char PROGMEM MQTTUSER[]   = "B";

#define showKeysInWeb true
//#define showKeysInWeb false

#define HiddenString "xxx"

WiFiClient espClient;
PubSubClient mqttClient(espClient);

// vvvvvvvvv Global Configuration vvvvvvvvvvv
#include <EEPROM.h>

void callback(char* topic, byte* payload, unsigned int length);

#ifdef MQTTBrokerChanged_existing
    void MQTTBrokerChanged();
#endif 

#ifdef usersubscribe_existing
    void UserSubscribe();
#endif

struct _GLOBAL_CONFIG {
    uint32_t    checksum;
    char        apname[32];
    char        mqttbroker[32];
    char        mqttclientname[32];
    char        rx_topic[32];
    char        tx_topic[32];
    char        mdnsname[32];
    uint32_t    ipaddress;  // if 0, use DHCP
    uint32_t    ipnetmask;
    uint32_t    ipgateway;
    uint32_t    ipdns1;
    uint32_t    ipdns2;
    char        updateUser[20];
    char        updatePassword[20];
    char        mqttPassword[20];
    char        mqttUser[20];  
    //uint8_t     userMem[1024];
};

struct _GLOBAL_CONFIG *pGC;
// ^^^^^^^^^ Global Configuration ^^^^^^^^^^^

// vvvvvvvvv ESP8266 WiFi vvvvvvvvvvv
#include <DNSServer.h>
#include <ESP8266WebServer.h>
#include <WiFiManager.h>          //https://github.com/tzapu/WiFiManager


WiFiManager wifiManager;

boolean DeviceEnteredConfigAp = false;

void configModeCallback (WiFiManager *myWiFiManager) {
    Serial.println("SW: Entered AP to config");
    DeviceEnteredConfigAp = true;
}

void wifi_setup(void) {
  //WiFiManager
  //Local intialization. Once its business is done, there is no need to keep it around
  //reset settings - for testing. Wipes out SSID/password.
  //wifiManager.resetSettings();
 
  
  //set callback that gets called when connecting to previous WiFi fails, and enters Access Point mode
  wifiManager.setAPCallback(configModeCallback);

  //fetches ssid and pass and tries to connect
  //if it does not connect it starts an access point with the specified name
  //here  "AutoConnectAP"
  //and goes into a blocking loop awaiting configuration
  /*
  #ifdef AllowAcessPoint
      wifiManager.setConfigPortalTimeout(180);
  #else
      // try to connect 3 times then go in a blocking loop for config AP
      wifiManager.setConfigPortalTimeout(1);
      if(!wifiManager.autoConnect(pGC->apname)){
        
      }
      wifiManager.setConfigPortalTimeout(180);
  #endif
  
  wifiManager.setConfigPortalTimeout(1);
  */
  
  
  
  wifiManager.setConfigPortalTimeout(1);
  
  uint8_t i = 0;
  bool connected = false;
  while((i <= 4)) {
    i++;
    Serial.println("SW: Try to connect");
    
    //if (wifiManager.autoConnect(pGC->apname)){
    if (wifiManager.connectWifi("","") == WL_CONNECTED){
        connected = true;
        Serial.println("SW: connected to saved WLAN dont try again");
        break;        
    }else{
        DeviceEnteredConfigAp = false;
    }
  }
  
  if (!connected){
      Serial.println("SW: start Config Portal because we have no connection to saved wlan");
      wifiManager.setConfigPortalTimeout(360);
      wifiManager.autoConnect(pGC->apname);
  }
  
  // if AP is active we have to reset the Gateway because the wifimanager sends a open AP
  if (DeviceEnteredConfigAp){
      #ifndef AllowAcessPoint
          WiFi.mode(WIFI_STA); //see https://github.com/kentaylor/WiFiManager/blob/master/examples/ConfigOnSwitch/ConfigOnSwitch.ino#L46
          Serial.println("SW: reset cause: AP is active");
          Serial.println("SW: Wait 10 seconds");
          Serial.print("current IP: ");
          //Serial.println(wifiManager.localIP());
          //Serial.println(WiFi.localIP();
          delay(10000);
          // ESP.reset dont works first time after serial flashing
          ESP.reset();
          while(1);
      #else
          Serial.println("SW: not connected to saved WLAN. Run Programm.");
      #endif
  }else{
      Serial.println("SW: connected to saved WLAN");
      WiFi.mode(WIFI_STA); //see https://github.com/kentaylor/WiFiManager/blob/master/examples/ConfigOnSwitch/ConfigOnSwitch.ino#L46
  }
}

// ^^^^^^^^^ ESP8266 WiFi ^^^^^^^^^^^

// vvvvvvvvv Global Configuration vvvvvvvvvvv
uint32_t gc_checksum() {
    uint8_t *p = (uint8_t *)pGC;
    uint32_t checksum = 0;
    p += sizeof(pGC->checksum);
    for (size_t i = 0; i < (sizeof(*pGC) - 4); i++) {
        checksum += *p++;
    }
    return checksum;
}

void eeprom_setup() {
    EEPROM.begin(4096);
    pGC = (struct _GLOBAL_CONFIG *)EEPROM.getDataPtr();
    // if checksum bad init GC else use GC values
    if (gc_checksum() != pGC->checksum) {
    //if (1){  
        Serial.println("Factory reset");
        memset(pGC, 0, sizeof(*pGC));
        Serial.println("AP_NAME");
        strcpy_P(pGC->apname, AP_NAME);
        Serial.println("MQTT_BROKER");
        strcpy_P(pGC->mqttbroker, MQTT_BROKER);
        Serial.println("copy topics");
        strcpy_P(pGC->rx_topic, RX_TOPIC);
        strcpy_P(pGC->tx_topic, TX_TOPIC);
        Serial.println("MDNS_NAME");
        strcpy_P(pGC->mdnsname, MDNS_NAME);
        Serial.println("mqttclientname");
        //bei der folgenden Zeile haengt sich der Chip auf: Exception (28)
        //strcpy(pGC->mqttclientname, WiFi.hostname().c_str());
        strncpy_P(pGC->mqttclientname, MQTTCLIENTNAME,32);
        Serial.println("UPDATEPW");
        strncpy_P(pGC->updateUser, UPDATEUSER, 20);
        strncpy_P(pGC->updatePassword, UPDATEPASSWORD, 20);    
        strncpy_P(pGC->mqttUser, MQTTUSER, 20);
        strncpy_P(pGC->mqttPassword, MQTTPASSWORD, 20);       
        Serial.println("checksum");
        pGC->checksum = gc_checksum();
        Serial.println("EEPROM.commit");
        EEPROM.commit();
    }
}

