boaschti/ESP8266-Server/ESP_Server/ESPServer.cpp
uint8_t eeprom_read_byte(uint16_t address){
    return 0;
    //return pGC->userMem[address];
}

uint8_t eeprom_write_byte(uint16_t address, uint8_t value){
    //pGC->userMem[address] = value;
    pGC->checksum = gc_checksum();
    //EEPROM.commit();
    return 0;
    //return pGC->userMem[address];
}

// ^^^^^^^^^ Global Configuration ^^^^^^^^^^^

// vvvvvvvvv ESP8266 web sockets vvvvvvvvvvv
#include <ESP8266mDNS.h>


MDNSResponder mdns;

void mdns_setup(void) {
    if (pGC->mdnsname[0] == '\0') return;

    if (mdns.begin(pGC->mdnsname, WiFi.localIP())) {
        Serial.println("MDNS responder started");
        mdns.addService("http", "tcp", 80);
        mdns.addService("ws", "tcp", 81);
    }else{
        Serial.println("MDNS.begin failed");
    }
    Serial.printf("Connect to http://%s or http://", pGC->mdnsname);
    Serial.println(WiFi.localIP());
}


static const char PROGMEM INDEX_HTML[] = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
<meta name = "viewport" content = "width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
<title>DeviceName</title>
<style>
"body { background-color: #808080; font-family: Arial, Helvetica, Sans-Serif; Color: #000000; }"
</style>
<h2>DeviceName</h2>
<div id="configureDeviceName">
  <p><a href="/configDevice"><button type="button">Configure DeviceName</button></a>
</div>
<div id="configureUserPage">
  <p><a href="/configUserPage"><button type="button">Configure UserPageName</button></a>
</div>
<div id="FirmwareUpdate">
  <p><a href="/updater"><button type="button">Update Firmware</button></a>
</div>
</body>
</html>
)rawliteral";

static const char PROGMEM CONFIGURE_HTML[] = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
  <meta name = "viewport" content = "width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
  <title>DeviceName Configuration</title>
  <style>
    "body { background-color: #808080; font-family: Arial, Helvetica, Sans-Serif; Color: #000000; }"
  </style>
</head>
<body>
  <h2>DeviceName Configuration</h2>
  <a href="/configDiv"><button type="button">Diverse</button></a>
  <p>
  <a href="/configMqtt"><button type="button">MQTT</button></a>
  <p>
  <a href="/"><button type="button">Home</button></a>
</body>
</html>
)rawliteral";

static const char PROGMEM CONFIGUREDIV_HTML[] = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
  <meta name = "viewport" content = "width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
  <title>DeviceName Configuration</title>
  <style>
    "body { background-color: #808080; font-family: Arial, Helvetica, Sans-Serif; Color: #000000; }"
  </style>
</head>
<body>
  <h3>DeviceName Configuration</h3>
  <form method='POST' action='/configDiv' enctype='multipart/form-data'>
    <label>Access Point name</label>
    <input type='text' name='apname' value="%s" size="32" maxlength="32"><br>
    <label>DNS name</label>
    <input type='text' name='mdnsname' value="%s" size="32" maxlength="32"><br>
    <label>Updater password:</label><br>
    <label>old user</label>
    <input type='text' name='olduser' value="%s" size="20" maxlength="20"><br>
    <label>old password</label>
    <input type='text' name='oldpassword' value="%s" size="20" maxlength="20"><br>
    <label>new user</label>
    <input type='text' name='newuser' size="20" maxlength="20"><br>
    <label>new password</label>
    <input type='text' name='newpassword' size="20" maxlength="20"><br>
    <p><input type='submit' value='Save changes'>
  </form>
  <p><a href="/configDevice"><button type="button">Cancel</button></a><a href="/configReset"><button type="button">Factory Reset</button></a>
</body>
</html>
)rawliteral";

static const char PROGMEM CONFIGUREMQTT_HTML[] = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
  <meta name = "viewport" content = "width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
  <title>DeviceName MQTT Configuration</title>
  <style>
    "body { background-color: #808080; font-family: Arial, Helvetica, Sans-Serif; Color: #000000; }"
  </style>
</head>
<body>
  <h3>DeviceName MQTT Configuration</h3>
  <form method='POST' action='/configMqtt' enctype='multipart/form-data'>
    <label>MQTT broker (none = off)</label>
    <input type='text' name='mqttbroker' value="%s" size="32" maxlength="32"><br>
    <label>MQTT client name</label>
    <input type='text' name='mqttclientname' value="%s" size="32" maxlength="32"><br>
    <label>MQTT client user</label>
    <input type='text' name='mqttclientuser' value="%s" size="32" maxlength="20"><br>
    <label>MQTT client password</label>
    <input type='text' name='mqttclientpassword' value="%s" size="32" maxlength="20"><br>
    <label>MQTT client Tx Topic</label>
    <input type='text' name='mqttclienttxtopic' value="%s" size="32" maxlength="20"><br>
    <label>MQTT client Rx Topic</label>
    <input type='text' name='mqttclientrxtopic' value="%s" size="32" maxlength="20"><br>    
    <label>note: if you have seen %s and changed MQTT broker then set RFM69 encrypt key again!</label>
    <p><input type='submit' value='Save changes'>
  </form>
  <p><a href="/configDevice"><button type="button">Cancel</button></a>
</body>
</html>
)rawliteral";

#ifndef userpage_existing 
    static const char PROGMEM USERPAGE_HTML[] = R"rawliteral(
    <!DOCTYPE html>
    <html>
    <head>
      <meta name = "viewport" content = "width = device-width, initial-scale = 1.0, maximum-scale = 1.0, user-scalable=0">
      <title>DeviceName MQTT Configuration</title>
      <style>
        "body { background-color: #808080; font-family: Arial, Helvetica, Sans-Serif; Color: #000000; }"
      </style>
    </head>
    <body>
      <h3>No Userpage defined or #define userpage_existing not set!</h3>
      <a href="/"><button type="button">Home</button></a>
    </body>
    </html>
    )rawliteral";
#endif

#include <WebSocketsServer.h>     //https://github.com/Links2004/arduinoWebSockets
#include <Hash.h>
ESP8266WebServer webServer(80);
WebSocketsServer webSocket = WebSocketsServer(81);

void webSocketEvent(uint8_t num, int type, uint8_t * payload, size_t length)
{
    Serial.printf("webSocketEvent(%d, %d, ...)\r\n", num, type);
    switch(type) {
    case WStype_DISCONNECTED:
      Serial.printf("[%u] Disconnected!\r\n", num);
      break;
    case WStype_CONNECTED:
      {
        IPAddress ip = webSocket.remoteIP(num);
        Serial.printf("[%u] Connected from %d.%d.%d.%d url: %s\r\n", num, ip[0], ip[1], ip[2], ip[3], payload);
      }
      break;
    case WStype_TEXT:
      Serial.printf("[%u] get Text: %s\r\n", num, payload);

