boaschti/ESP8266-Server/ESP_Server/ESPServer.cpp
      // send data to all connected clients
      //webSocket.broadcastTXT(payload, length);
      break;
    case WStype_BIN:
      Serial.printf("[%u] get binary length: %u\r\n", num, length);
      //hexdump(payload, length);

      // echo data back to browser
      //webSocket.sendBIN(num, payload, length);
      break;
    default:
      Serial.printf("Invalid WStype [%d]\r\n", type);
      break;
    }
}

void handleRoot()
{
    Serial.print("Free heap="); Serial.println(ESP.getFreeHeap());
    
    webServer.send_P(200, "text/html", INDEX_HTML);
}

void handleNotFound()
{
    String message = "File Not Found\n\n";
    message += "URI: ";
    message += webServer.uri();
    message += "\nMethod: ";
    message += (webServer.method() == HTTP_GET)?"GET":"POST";
    message += "\nArguments: ";
    message += webServer.args();
    message += "\n";
    for (uint8_t i=0; i<webServer.args(); i++){
        message += " " + webServer.argName(i) + ": " + webServer.arg(i) + "\n";
    }
    webServer.send(404, "text/plain", message);
}

void handleconfigureDevice()
{
    webServer.send_P(200, "text/html", CONFIGURE_HTML);
}

// Reset global config back to factory defaults
void handleconfigureReset()
{
    pGC->checksum++;
    wifiManager.resetSettings();
    EEPROM.commit();
    ESP.reset();
    delay(1000);
}

void handleconfigureDiv()
{
    size_t formFinal_len = strlen_P(CONFIGUREDIV_HTML) + sizeof(*pGC);
    char *formFinal = (char *)malloc(formFinal_len);
    if (formFinal == NULL) {
        Serial.println("formFinal malloc failed");
        return;
    }
    #if showKeysInWeb == true
      snprintf_P(formFinal, formFinal_len, CONFIGUREDIV_HTML,
          pGC->apname, pGC->mdnsname, pGC->updateUser, pGC->updatePassword
          );
    #else
      snprintf_P(formFinal, formFinal_len, CONFIGUREDIV_HTML,
          pGC->apname, pGC->mdnsname, HiddenString, HiddenString
          );
    #endif
    webServer.send(200, "text/html", formFinal);
    free(formFinal);
}

void handleconfigureDivWrite()
{
    bool commit_required = false;
    bool oldPasswordSeen = false;
    bool oldUserSeen = false;
    String argi, argNamei;

    for (uint8_t i=0; i<webServer.args(); i++) {
        Serial.print(webServer.argName(i));
        Serial.print('=');
        Serial.println(webServer.arg(i));
        argi = webServer.arg(i);
        argNamei = webServer.argName(i);
        if (argNamei == "apname") {
          const char *apname = argi.c_str();
            if (strcmp(apname, pGC->apname) != 0) {
                commit_required = true;
                strcpy(pGC->apname, apname);
            }
        }
        else if (argNamei == "olduser") {
            const char *olduser = argi.c_str();
            if (strcmp(olduser, HiddenString) != 0){
                if (strcmp(olduser, pGC->updateUser) == 0) {
                    oldUserSeen = true;
                }
            }
        }
        else if (argNamei == "oldpassword") {
            const char *oldpw = argi.c_str();
            if (strcmp(oldpw, HiddenString) != 0){
                if (strcmp(oldpw, pGC->updatePassword) == 0) {
                    oldPasswordSeen = true;
                }
            }
        }
        else if (argNamei == "newuser") {
          const char *newusr = argi.c_str();
            if ((strcmp(newusr, HiddenString) != 0) && oldPasswordSeen && oldUserSeen){
                if (strcmp(newusr, pGC->updatePassword) != 0) {
                    commit_required = true;
                    strcpy(pGC->updateUser, newusr);
                    Serial.println("user changed");
                }
            }
        }
        else if (argNamei == "newpassword") {
          const char *newpw = argi.c_str();
            if ((strcmp(newpw, HiddenString) != 0) && oldPasswordSeen && oldUserSeen){
                if (strcmp(newpw, pGC->updatePassword) != 0) {
                    commit_required = true;
                    strcpy(pGC->updatePassword, newpw);
                    Serial.println("password changed");
                }
            }
        }
        else if (argNamei == "mdnsname") {
            const char *mdns = argi.c_str();
            if (strcmp(mdns, pGC->mdnsname) != 0) {
                commit_required = true;
                strcpy(pGC->mdnsname, mdns);
            }
        }
    }
    handleRoot();
    if (commit_required) {
        pGC->checksum = gc_checksum();
        EEPROM.commit();
        ESP.reset();
        delay(1000);
    }
}

void handleconfigureMqtt()
{
    size_t formFinal_len = strlen_P(CONFIGUREMQTT_HTML) + sizeof(*pGC);
    char *formFinal = (char *)malloc(formFinal_len);
    if (formFinal == NULL) {}
    #if showKeysInWeb == true
        snprintf_P(formFinal, formFinal_len, CONFIGUREMQTT_HTML,
        pGC->mqttbroker, pGC->mqttclientname, pGC->mqttUser, pGC->mqttPassword, pGC->tx_topic, pGC->rx_topic, HiddenString
        );
    #else
        snprintf_P(formFinal, formFinal_len, CONFIGUREMQTT_HTML,
        HiddenString, pGC->mqttclientname,  HiddenString, HiddenString, pGC->tx_topic, pGC->rx_topic, HiddenString
        );
    #endif
    webServer.send(200, "text/html", formFinal);
    free(formFinal);
}

void handleconfigureMqttWrite()
{
    bool commit_required = false;
    String argi, argNamei;

    for (uint8_t i=0; i<webServer.args(); i++) {
        Serial.print(webServer.argName(i));
        Serial.print('=');
        Serial.println(webServer.arg(i));
        argi = webServer.arg(i);
        argNamei = webServer.argName(i);
        if (argNamei == "mqttbroker") {
            const char *broker = argi.c_str();
            if (strcmp(broker, HiddenString) != 0){
                if (strcmp(broker, pGC->mqttbroker) != 0) {
                    commit_required = true;
                    strcpy(pGC->mqttbroker, broker);
                    #ifdef MQTTBrokerChanged_existing
                        MQTTBrokerChanged();
                    #endif
                }
            }
        }
        else if (argNamei == "mqttclientname") {
            const char *client = argi.c_str();
            if (strcmp(client, pGC->mqttclientname) != 0) {
                commit_required = true;
                strcpy(pGC->mqttclientname, client);
            }
        }
        else if (argNamei == "mqttclientpassword"){
            const char *pw = argi.c_str();
            if (strcmp(pw, HiddenString) != 0){
                if (strcmp(pw, pGC->mqttPassword) != 0){
                    commit_required = true;
                    strcpy(pGC->mqttPassword, pw);
                }
            }
        }
        else if (argNamei == "mqttclientuser"){
            const char *user = argi.c_str();
            if (strcmp(user, HiddenString) != 0){
                if (strcmp(user, pGC->mqttUser) != 0){
                    commit_required = true;
                    strcpy(pGC->mqttUser, user);
                }
            }
        }
        else if (argNamei == "mqttclienttxtopic"){
            const char *txtopic = argi.c_str();

            if (strcmp(txtopic, pGC->tx_topic) != 0){
                commit_required = true;
                strcpy(pGC->tx_topic, txtopic);
            }

