boaschti/ESP8266-Server/ESP_Server/ESPServer.cpp
        }
        else if (argNamei == "mqttclientrxtopic"){
            const char *rxtopic = argi.c_str();

            if (strcmp(rxtopic, pGC->rx_topic) != 0){
                commit_required = true;
                strcpy(pGC->rx_topic, rxtopic);
            }

        }
    }

    handleRoot();
    if (commit_required) {
        pGC->checksum = gc_checksum();
        EEPROM.commit();
        ESP.reset();
        delay(1000);
    }
}

#ifndef userpage_existing
    void handleconfigureUserWrite(){
        handleRoot();
    }
    void handleconfigureUser(){
        webServer.send_P(200, "text/html", USERPAGE_HTML);
    }
#else
    void handleconfigureUserWrite();
    void handleconfigureUser();
#endif

void webServersend_P(const char* html){
    webServer.send_P(200, "text/html", html);
}

void websock_setup(void) {
    webServer.on("/", handleRoot);
    webServer.on("/configDevice", HTTP_GET, handleconfigureDevice); //startpage
    webServer.on("/configMqtt", HTTP_GET, handleconfigureMqtt);
    webServer.on("/configMqtt", HTTP_POST, handleconfigureMqttWrite);
    webServer.on("/configDiv", HTTP_GET, handleconfigureDiv);
    webServer.on("/configDiv", HTTP_POST, handleconfigureDivWrite);
    webServer.on("/configReset", HTTP_GET, handleconfigureReset);
    webServer.on("/configUserPage", HTTP_GET, handleconfigureUser);
    webServer.on("/configUserPage", HTTP_POST, handleconfigureUserWrite);
    webServer.onNotFound(handleNotFound);
    webServer.begin();

    webSocket.begin();
    webSocket.onEvent(webSocketEvent);
}

// ^^^^^^^^^ ESP8266 web sockets ^^^^^^^^^^^


// vvvvvvvvv ESP8266 Web OTA Updater vvvvvvvvvvv
#include "ESP8266HTTPUpdateServer.h"
ESP8266HTTPUpdateServer httpUpdater;

void ota_setup() {
    httpUpdater.setup(&webServer, "/updater", pGC->updateUser, pGC->updatePassword);//sw
}

// ^^^^^^^^^ ESP8266 Web OTA Updater ^^^^^^^^^^^



// vvvvvvvvv MQTT vvvvvvvvvvv
// *** Be sure to modify PubSubClient.h ***
//
// Be sure to increase the MQTT maximum packet size by modifying
// PubSubClient.h. Add the following line to the top of PubSubClient.h.
// Failure to make this modification means no MQTT messages will be
// published.
// #define MQTT_MAX_PACKET_SIZE 256




void mqtt_setup() {
    mqttClient.setServer(pGC->mqttbroker, 1883);
    mqttClient.setCallback(callback);
}
// If a UserSubscribe Funktion is declared we call it in the reconnect funktion


void reconnect() {
    
    static unsigned long timeLastConn = 0;
    static bool everConnected = false;
    

    // connect after 50s again
    if ((!timeLastConn) || ((timeLastConn + 100000) < millis())){
        timeLastConn = millis();
        //check WiFi Verbindung
        //Wenn wir schon mal verbunden waren und die Verbindung verlohren haben kann es auch am Wlan liegen. z.B. falscher AP wenn Repeater verbaut sind
        if (WiFi.status() == WL_CONNECTED){
            everConnected = true;
        }else if(everConnected){
            Serial.print("Try to Connect to WLAN again: ");
            //WiFi.disconnect();
            //delay(1000);
            Serial.println(wifiManager.connectWifi("","")); 
        }
        
        //check mqtt Verbindung
        if (!mqttClient.connected()) {
            if (strncmp(pGC->mqttbroker, "none", 4) != 0){
                Serial.print("Attempting MQTT connection...");
                // Attempt to connect
                if (mqttClient.connect(pGC->mqttclientname, pGC->mqttUser, pGC->mqttPassword)) {
                    delay(1000);
                    if (mqttClient.connected()) {
                        Serial.println("connected");
                        // Once connected, publish an announcement...
                        mqttClient.publish("DeviceName_Info", "connected");
                        // ... and resubscribe
                        #ifdef usersubscribe_existing
                            UserSubscribe();
                        #endif
                        delay(1000);
                        if (strlen(pGC->rx_topic)){
                            mqttClient.subscribe(pGC->rx_topic);
                        }
                        Serial.printf("subscribed to topic [%s]\r\n", pGC->rx_topic);
                    } else {
                        Serial.println("not connected");
                    }
                } else {
                    Serial.print("failed, rc=");
                    Serial.print(mqttClient.state());
                    Serial.println(" try again in 100s");
                }
            }
        }
    }
}

void mqtt_loop() {

    reconnect();
    
    mqttClient.loop();
}

void mqttpublishJSON(const char* key, const char* value){
    char payload[200] ="\"";
    strncat(payload, key, 100);
    strncat(payload, "\":\"", 10);
    strncat(payload, value, 100);
    strncat(payload, "\"", 10);
    mqttClient.publish(pGC->tx_topic, payload);
}

void mqttpublishTXTopic(const char* payload){
     mqttClient.publish(pGC->tx_topic, payload);
}

void mqttpublish(const char* topic, const char* payload){
     mqttClient.publish(topic, payload);
}

void mqttpublish(const char* topic, const char* payload, boolean retained){
     mqttClient.publish(topic, payload, retained);
}

boolean mqttConnected(){
    return mqttClient.connected();
}

void mqttSubscribe(const char* topic){
    mqttClient.subscribe(topic);
}

void mqttUnsubscribe(const char* topic){
    mqttClient.unsubscribe(topic);
}

void mqttSubscribeStateTopic(){
    mqttClient.subscribe(pGC->tx_topic);
}

void mqttUnsubscribeStateTopic(){
    mqttClient.unsubscribe(pGC->tx_topic);
}

// ^^^^^^^^^ MQTT ^^^^^^^^^^^


// Start webserver, ota, mqtt ect complete

void setup_server(){
    
    Serial.begin(SERIAL_BAUD);
    Serial.println("eeprom_setup");
    eeprom_setup();
    Serial.println("wifi_setup");
    wifi_setup();
    Serial.println("mdns_setup");
    mdns_setup();
    Serial.println("mqtt_setup");
    mqtt_setup();
    Serial.println("ota_setup");
    ota_setup();
    Serial.println("websock_setup");
    websock_setup();
    Serial.println("webserver_setup_finished");
    
}

void loop_server(){
  
    mqtt_loop();
    //Serial.println("webSocket");
    webSocket.loop();
    //Serial.println("webServer");
    webServer.handleClient();
}

